Tsung/writeUserPathTest.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="52.91.45.201" port="80" type="tcp"></server>
  </servers>

  <load>
  <arrivalphase phase="1" duration="1" unit="second">
    <users arrivalrate="1" unit="second"></users>
  </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <transaction name = "index">
        <request>
          <http url='/' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <thinktime value="1" random="true"></thinktime>

      <transaction name="signup">
        <request>
          <http url='/' version='1.1' method='GET'></http>
        </request>
        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http url="/users/sign_up" version='1.1' method='GET'></http>
        </request>
        <setdynvars sourcetype="random_number" start="1000" end="9999999">
          <var name="random_user_name" />
        </setdynvars>
        <setdynvars sourcetype="random_string" length="13">
          <var name="random_email_name" />
        </setdynvars>
        <setdynvars sourcetype="random_string" length="13">
          <var name="random_password" />
        </setdynvars>
        <request subst="true">
          <http url="/users" method="POST" version="1.1"
                contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_random_email_name%%@gmail.com&amp;user%5Bpassword%5D=%%_random_email_name%%&amp;user%5Bpassword_confirmation%5D=%%_random_email_name%%&amp;commit=Sign+up">
          </http>
        </request>
      </transaction>


      <thinktime value="1" random="true"></thinktime>

      <transaction name = "google_trends_home">
        <request>
          <dyn_variable name="gts_css" re="&#x22;(\/assets/[^&#x22;]*).css&#x22;"/>
          <dyn_variable name="gts_js" re="&#x22;(\/assets/[^&#x22;]*).js&#x22;"/>
          <http url='/google_trends_strategy/index' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <thinktime value="2" random="true"></thinktime>

      <transaction name = "google_trends_query">
        <request>
          <http url="/indices/hints.json?query=AP" version="1.1" method="GET"></http>
        </request>
        <request>
          <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
          <http url='/random_gt_query/gts' version='1.1' method='GET'></http>
        </request>
        <request subst="true">
          <http url="%%_redirect%%" method="GET"></http>
        </request>
      </transaction>

      <thinktime value="2" random="true"></thinktime>

      <transaction name = "volume_home">
        <request>
          <http url='/volume_chart/index' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <thinktime value="2" random="true"></thinktime>


      <transaction name = "volume_query">
        <request>
          <http url="/indices/hints.json?query=GO" version="1.1" method="GET"></http>
        </request>
        <request>
          <dyn_variable name="redirect2" re="Location: (http://.*)\r"/>
         <http url='/random_gt_query/volume' version='1.1' method='GET'></http>
        </request>
        <request subst="true">
          <http url="%%_redirect2%%" method="GET"></http>
        </request>
      </transaction>

      <transaction name="investment">
        <request>
          <http url="/investments" version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/investments/new' version='1.1' method='GET'></http>
        </request>
        <request subst="true">
          <http url='/investments' version='1.1' method='POST'
                contents='utf8=%E2%9C%93&amp;stockName=Apple+Inc.%28AAPL%29&amp;quantity=10&amp;commit=Create+Investment' ></http>
        </request>
      </transaction>


    </session>
  </sessions>
</tsung>